app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("first_name", "last_name", "ages", "gender", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["first_name", "Klaus"], ["last_name", "Li1"], ["ages", 12], ["gender", "male"], ["created_at", "2020-01-01 09:41:57.749780"], ["updated_at", "2020-01-01 09:41:57.749780"]]

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "last_name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["last_name", "on99"], ["updated_at", "2019-12-31 07:57:01.102160"], ["id", 2]]

  def count
    @users = User.all
---
SELECT "users".* FROM "users"

  def name
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]